{
  "agreement":
  {
    "title": "User Agreement",
    "search": "Search",
    "agreement": "User Agreement",
    "text": "<h2>Introduction</h2>\nWelcome to PyOSINT (hereinafter referred to as \"the Service\"). The Service specializes in the collection and analysis of information from publicly available sources for the purpose of providing analytical services. Our activities strictly comply with the current legislation of the Russian Federation, as well as international norms and standards in data processing.\n\n<br><br><h2>Acceptance of Terms</h2>\n<h3>Consent to the Terms</h3>\nBy using the services of the Service, the user automatically confirms their unconditional agreement with these Terms of Service (hereinafter referred to as \"Terms\"), published in this section of the website. This consent is legally binding and is equivalent to signing a written contract.\n<h3>Familiarization with the Terms</h3>\nBefore starting to use the services of the Service, it is necessary to carefully review all the points of the Terms. Should there be any questions regarding the interpretation or application of the Terms, the Service strongly recommends contacting support for clarification.\n<h3>Disagreement with the Terms</h3>\nIf the user does not agree with any of the points of the Terms, or if any conditions are legally, morally, or otherwise personally unacceptable to the user, the user must immediately cease using the services of the Service. Continued use of the Service's services after becoming acquainted with the Terms will be considered as the user's full and unconditional agreement with them.\n<h3>Changes to the Terms</h3>\nThe Service reserves the right to make changes to the Terms at any time without prior notice. Updated versions of the Terms will be posted on our website with the date of the latest update, and they become effective immediately. The Service recommends that users regularly review the Terms for changes. Continued use of the Service's services after the publication of modified Terms will be considered as the user's consent to the updated terms.\n\n<br><br><h2>User Obligations</h2>\n<h3>General Provisions</h3>\nWhen using the Service, users must adhere not only to the terms of this agreement but also to the current legislation of the Russian Federation, the legislation of the user's country of residence, as well as the Service's international legal norms and agreements.\n<h3>Prohibited Actions</h3>\nIt is strictly forbidden to:\n<br>* Use the Service for committing illegal actions, including but not limited to: violating intellectual property rights, spreading viruses, engaging in fraud, distributing pornography, sending spam, and conducting hacking attacks.\n<br>* Use automated systems or software to extract data from the Service without written permission from the Service.\n<h3>Responsibility for Extending Functionality</h3>\nUsers may at their discretion add functionality to the application thanks to its modular and extensible architecture. However, users are fully responsible for any changes to the code and the addition of new modules, as well as for adhering to security and data confidentiality rules when using them.\n<h3>Responsibility for Compliance with Legislation</h3>\nUsers must independently keep track of changes in legislation concerning the use of internet services and data processing. The Service is not responsible for illegal use of the Service by the user or for actions that may be considered unlawful.\n<h3>Maintaining Confidentiality</h3>\nUsers must ensure the confidentiality of information obtained as a result of using the Service, especially if this information contains personal data of third parties or confidential data. Failure to maintain confidentiality may lead to legal liability.\n<h3>Compliance with Data Processing Rules</h3>\nUsers must adhere to all applicable data processing rules and laws, including but not limited to the General Data Protection Regulation (GDPR) for users from the European Union.\n<h3>Notification of Violations</h3>\nIf a user encounters a breach of the agreement's terms by other users or third parties, they should immediately report this to the Service's support service.\n\n<br><br><h2>Using the Service</h2>\n<h3>Purpose of Use</h3>\nThe Service is provided to users exclusively for lawful purposes. This means that all actions performed within the use of the Service must comply with the current legislation of the Russian Federation, international legal norms, and the legislation of the user's country of residence.\n<h3>Prohibited Use</h3>\nUsers are required to refrain from any use of the Service that could be classified as illegal or unauthorized, including, but not limited to the following:\n<br>* Violation of Legislation: Using the Service for actions that contradict laws, such as data falsification, fraud, copyright infringement, or trademark rights.\n<br>* Unauthorized Access: Attempts to gain access to password-protected parts of the Service, or to servers and networks connected to the Service, without explicit permission.\n<br>* Malicious Actions: Distribution of viruses, Trojans, malicious software, or using the Service to conduct Denial of Service (DDoS) attacks.\n<br>* Illegal Trade: Using the Service for the trade of prohibited goods or services, including, but not limited to, drugs, weapons, and counterfeit products.\n<h3>Responsibility for Violations</h3>\nAny use of the Service that contradicts the stated prohibitions will be considered a serious violation of the terms of this agreement. The Service reserves the right to apply all available legal measures to address such violations, including, but not limited to, temporary or permanent cessation of services, as well as reporting to law enforcement agencies.\n<h3>Compliance with Regulatory Requirements</h3>\nThe Service also strongly recommends that users regularly review their actions in the context of changes in legislation related to the use of internet resources and digital services to avoid possible legal violations. The application parses data exclusively from publicly available websites, ensuring that the data is not protected by copyright or other restrictions on use. Users must ensure that the use of data obtained through the Service does not violate applicable laws or regulations in their jurisdiction.\n\n<br><br><h2>Data Collection</h2>\n<h3>Data Sources</h3>\nThe Service collects information exclusively from publicly available sources. This includes public databases, open registers, websites that do not restrict indexing by search engines, social networks where users have set their profiles to public, and other open platforms.\n<h3>Purpose of Data Collection</h3>\nThe Service does not use the collected data to create personal profiles of individuals without their explicit consent, unless required by law.\n<h3>Data Rights</h3>\nAlthough the data is collected from publicly available sources, the Service does not claim ownership rights over this data. All data remain the property of their rightful owners. The Service commits to not selling, transferring, or using the collected data for commercial purposes other than for the purposes specified in this agreement, and always with respect to the rights of the data subjects.\n<h3>Data Storage</h3>\nThe application does not store any data during usage, except for data that users decide to save themselves. This includes data collected as a result of the user configuring specific modules of the application to save information.\n\n<br><br><h2>Liability</h2>\n<h3>Disclaimer of Liability</h3>\nBy using the Service, the user assumes all risks associated with its use. The developers of the Service are not liable for any direct, indirect, incidental, consequential, or punitive damages, including, but not limited to, lost profits, data loss, or business interruption, arising from the use or inability to use the Service, even if the Service has been advised of the possibility of such damages.\n<h3>Indemnification and Release</h3>\nThe user agrees to defend, indemnify, and hold harmless the Service, its affiliates, licensors, employees, agents, third-party information providers, and service providers from any claims, damages, obligations, lawsuits, and expenses, including, but not limited to, reasonable legal and accounting fees, arising from or related to the user’s use of the Service, violation of this Agreement, or infringement of third-party rights.\n<h3>Provision of the Application</h3>\nAs an open-source application, the Service is provided \"as is\" without any warranties. Developers and distributors are not responsible for any direct or indirect damage resulting from its use, including, but not limited to, errors, accidental data deletion, or unavailability of the Service.\n\n<br><br><h2>Changes to Terms</h2>\n<h3>Right to Modify</h3>\nThe Service reserves the right at any time to modify or replace these Terms of Service without prior notice to users. Changes may be prompted by the need to comply with new legislative requirements, changes in processes, services, or for any other reasons deemed sufficient by the Service.\n<h3>Notification of Changes</h3>\nWhile the Service reserves the right not to notify users of minor changes, it strives to ensure that users are informed of significant changes to the Terms of Service that may affect their use of the Service's services.\n<h3>Effectiveness of Changes</h3>\nAny changes or additions to the Terms of Service become effective immediately upon their publication in this section of the Service, unless otherwise stated in the change notification. Continued use of the Service's services after changes have been made will be considered as the user's unconditional agreement with the updated terms.\n<h3>User Responsibilities</h3>\nThe Service recommends that users regularly review the Terms of Service for changes and updates. Continuation of the use of the Service by the user after the publication of modified terms implies the user's agreement with these changes.\n<h3>Disclaimers of Consequences of Changes</h3>\nThe Service is not responsible for any losses or inconveniences caused by the user's failure to comply with the requirement to regularly review the Terms of Service."
  },
  "search":
  {
    "title": "Search",
    "search": "Search",
    "agreement": "User Agreement",
    "input": "Enter data for searching..."
  },
  "errors":
  {
    "api_connection": "Please, check connection to API server.",
    "generic": "Error!",
    "404": "404 - Not found error. Return to Search page, please.",
    "500": "500 Server-side error. Return to Search page, please."
  }
}