{
  "agreement":
  {
    "title": "Пользовательское соглашение",
    "search": "Поиск",
    "agreement": "Пользовательское соглашение",
    "text": "<h2>Введение</h2>\n        Добро пожаловать в PyOSINT (далее - Сервис ). Сервис специализируемся на сборе и анализе информации из общедоступных источников с целью предоставления аналитических услуг. Деятельность строго соответствует действующему законодательству Российской Федерации, а также международным нормам и стандартам в области обработки данных.\n\n        <br><br><h2>Принятие условий</h2>\n        <h3>Согласие с условиями</h3>\n        Используя услуги Сервиса, пользователь автоматически подтверждает свое безоговорочное согласие с настоящими Условиями обслуживания (далее – Условия), опубликованными в данном разделе сайта. Это согласие является юридически обязывающим и приравнивается к подписанию письменного договора.\n        <h3>Знакомство с условиями</h3>\n        Перед началом использования услуг Сервиса, необходимо внимательно ознакомиться со всеми пунктами Условий. В случае возникновения вопросов по толкованию или применению Условий, Сервис настоятельно рекомендуем обратиться за разъяснениями к службе поддержки.\n        <h3>Несогласие с условиями</h3>\n        Если пользователь не согласен с любым из пунктов Условий, или если какие-либо условия являются для пользователя неприемлемыми по юридическим, моральным или иным личным причинам, пользователь должен немедленно прекратить использование услуг Сервиса. Продолжение использования услуг Сервиса после ознакомления с Условиями будет рассматриваться как полное и безоговорочное согласие пользователя с ними.\n        <h3>Изменения в условиях</h3>\n        Сервис оставляет за собой право вносить изменения в Условия в любое время без предварительного уведомления. Обновленные версии Условий будут размещаться на нашем сайте с указанием даты последнего обновления, и они вступают в силу немедленно. Сервис рекомендует пользователям регулярно пересматривать Условия на предмет изменений. Продолжение использования услуг Сервиса после публикации измененных Условий будет считаться согласием пользователя с обновленными условиями.\n\n        <br><br><h2>Обязанности пользователя</h2>\n        <h3>Основные положения</h3>\n        При использовании услуг Сервис, пользователь обязан соблюдать не только условия настоящего соглашения, но и действующее законодательство Российской Федерации, законодательство страны пребывания пользователя, а также международные правовые нормы Сервиса и соглашения.\n        <h3>Запрещенные действия</h3>\n        Строго запрещается:\n        <br>* Использовать Сервис для совершения незаконных действий, включая, но не ограничиваясь: нарушение прав интеллектуальной собственности, распространение вирусов, мошенничество, распространение порнографии, отправка спама и осуществление хакерских атак.\n        <br>* Применять автоматизированные системы Сервиса или программное обеспечение для извлечения данных из Сервиса без письменного разрешения Сервиса.\n        <h3>Ответственность за расширение функционала</h3>\n        Пользователи могут на свое усмотрение добавлять функциональность в приложение благодаря его модульной и расширяемой архитектуре. При этом пользователи несут полную ответственность за любые изменения в коде и добавление новых модулей, а также за соблюдение правил безопасности и конфиденциальности данных при их использовании.\n        <h3>Ответственность за соблюдение законодательства</h3>\n        Пользователь обязан самостоятельно следить за изменениями в законодательстве, касающимся использования интернет-сервисов и обработки данных. Сервис не несет ответственности за незаконное использование Сервиса пользователем или за действия, которые могут быть расценены как неправомерные.\n        <h3>Сохранение конфиденциальности</h3>\n        Пользователю необходимо обеспечить конфиденциальность информации, полученной в результате использования Сервиса, особенно если эта информация содержит персональные данные третьих лиц или конфиденциальные данные. Несоблюдение конфиденциальности может привести к юридической ответственности.\n        <h3>Соблюдение правил обработки данных</h3>\n        Пользователь должен соблюдать все применимые правила и законы об обработке данных, включая, но не ограничиваясь, Регламент о защите данных (GDPR) для пользователей из Европейского Союза.\n        <h3>Уведомление о нарушениях</h3>\n        Если пользователь столкнулся с нарушением условий соглашения другими пользователями или третьими лицами, ему следует незамедлительно сообщить об этом в службу поддержки Сервиса.\n\n        <br><br><h2>Использование Сервиса</h2>\n        <h3>Цели использования</h3>\n        Сервис предоставляется пользователям исключительно для законных целей. Это означает, что все действия, выполняемые в рамках использования Сервиса, должны соответствовать действующему законодательству Российской Федерации, международным правовым нормам и законодательству страны пребывания пользователя.\n        <h3>Запрещённое использование</h3>\n        Пользователь обязан воздерживаться от любого использования Сервиса, которое может быть классифицировано как незаконное или несанкционированное, включая, но не ограничиваясь следующим:\n        <br>* Нарушение законодательства: Использование Сервиса для действий, противоречащих законам, таких как фальсификация данных, мошенничество, нарушение авторских прав или прав на торговые марки.\n        <br>* Несанкционированный доступ: Попытки получения доступа к частям Сервиса, защищённым паролями, или к серверам и сетям, связанным с Сервисом, без явного разрешения.\n        <br>* Вредоносные действия: Распространение вирусов, троянов, вредоносного программного обеспечения или использование Сервиса для проведения атак типа \"отказ в обслуживании\" (DDoS).\n        <br>* Незаконная торговля: Использование Сервиса для торговли запрещёнными товарами или услугами, включая, но не ограничиваясь, наркотическими средствами, оружием и контрафактной продукцией.\n        <h3>Ответственность за нарушение</h3>\n        Любое использование Сервиса, противоречащее указанным запретам, будет рассматриваться как серьёзное нарушение условий данного соглашения. Сервис оставляет за собой право применить все доступные юридические меры для пресечения таких нарушений, включая, но не ограничиваясь, временное или постоянное прекращение предоставления услуг, а также обращение в правоохранительные органы.\n        <h3>Соблюдение регулятивных требований</h3>\n        Сервис также настоятельно рекомендует пользователям регулярно пересматривать свои действия в контексте изменений законодательства, связанного с использованием интернет-ресурсов и цифровых сервисов, чтобы избежать возможных правовых нарушений. Приложение осуществляет парсинг данных исключительно с общедоступных веб-сайтов, удостоверяясь в том, что данные не охраняются авторским правом или другими ограничениями на использование. Пользователи должны убедиться, что использование данных, полученных с помощью Сервис , не нарушает применимых законов или правил, действующих в их юрисдикции.\n\n\n        <br><br><h2>Сбор данных</h2>\n        <h3>Источники данных</h3>\n        Сервис собирает информацию исключительно из общедоступных источников. Это включает в себя публичные базы данных, открытые регистры, веб-сайты, которые не ограничивают индексацию поисковыми системами, социальные сети, где пользователи настроили свои профили как общедоступные, и другие открытые платформы.\n        <h3>Цели сбора данных</h3>\n        Сервис не использует собранные данные для создания персональных профилей отдельных лиц без их явного согласия, если только это не требуется по закону.\n        <h3>Права на данные</h3>\n        Хотя данные собираются из общедоступных источников, Сервис не претендует на права собственности на эти данные. Все данные остаются собственностью их законных владельцев. Сервис обязуемся не продавать, передавать или использовать собранные данные в коммерческих целях, кроме как для целей, указанных в настоящем соглашении, и всегда с уважением к правам субъектов данных.\n        <h3>Хранение данных</h3>\n        Приложение не сохраняет никакие данные в процессе использования, за исключением данных, которые пользователь самостоятельно решает сохранить. Это включает в себя данные, собранные в результате настройки пользователем конкретных модулей приложения для сохранения информации.\n\n        <br><br><h2>Ответственность</h2>\n        <h3>Освобождение от ответственности</h3>\n        При использовании Сервиса пользователь принимает на себя все риски, связанные с его использованием. Разработчики Сервиса, не несут ответственности за любые прямые, косвенные, случайные, следственные или штрафные убытки, включая, но не ограничиваясь, упущенную выгоду, потерю данных или прерывание бизнеса, возникшие в результате использования или невозможности использования Сервиса, даже если Сервис были уведомлен о возможности таких убытков.\n        <h3>Защита и освобождение от ответственности</h3>\n        Пользователь соглашается защищать, возмещать убытки и освобождать от ответственности Сервис, его аффилированные лица, лицензиаров, сотрудников, агентов, третьих лиц-поставщиков информации и лиц, предоставляющих услуги, от любых претензий, убытков, обязательств, судебных исков и расходов, включая, но не ограничиваясь, разумные юридические и бухгалтерские расходы, возникающие в результате или связанные с использованием пользователем Сервиса, нарушением настоящего Соглашения или нарушением прав третьих лиц.\n        <h3>Предоставление приложения</h3>\n        Как приложение с открытым исходным кодом, Сервис предоставляется “как есть” без каких-либо гарантий. Разработчики и распространители не несут ответственности за прямой или косвенный ущерб, возникший в результате его использования, включая, но не ограничиваясь, ошибки, случайное удаление данных или недоступность Сервиса.\n\n        <br><br><h2>Изменения условий</h2>\n        <h3>Право на изменение</h3>\n        Сервис оставляет за собой право в любое время изменять или заменять настоящие Условия обслуживания без предварительного уведомления пользователей. Изменения могут быть вызваны необходимостью соответствия новым законодательным требованиям, изменениями в процессах, услугах или по любым другим причинам, которые Сервис посчитает достаточными.\n        <h3>Уведомление о изменениях</h3>\n        Хотя Сервис оставляет за собой право не уведомлять о незначительных изменениях, Сервис стремится к тому, чтобы пользователи были осведомлены о важных изменениях в Условиях обслуживания, которые могут повлиять на их использование услуг Сервиса.\n        <h3>Вступление изменений в силу</h3>\n        Любые изменения или дополнения к Условиям обслуживания вступают в силу немедленно после их публикации в данном разделе Сервиса, если не указано иное в уведомлении об изменениях. Продолжение использования услуг Сервиса после внесения изменений будет рассматриваться как безоговорочное согласие пользователя с обновлёнными условиями.\n        <h3>Обязанности пользователя</h3>\n        Сервис рекомендует регулярно пересматривать Условия обслуживания на предмет изменений и обновлений. Продолжение использования Сервиса пользователем после публикации изменённых условий означает согласие пользователя с этими изменениями.\n        <h3>Отказ от последствий изменений</h3>\n        Сервис не несёт ответственности за любые убытки или неудобства, вызванные несоблюдением пользователем требования регулярно ознакамливаться с Условиями обслуживания."
  },
  "search":
  {
    "title": "Поиск",
    "search": "Поиск",
    "agreement": "Пользовательское соглашение",
    "input": "Введите данные для поиска"
  },
  "errors":
  {
    "api_connection": "Пожалуйста, проверьте соединение с API-сервером.",
    "generic": "Ошибко!",
    "404": "404 - Ошибка. Не найдено. Вернитесь на страницу Поиска, пожалуйста.",
    "500": "500 - Ошибка на стороне сервера. Вернитесь на страницу Поиска, пожалуйста."
  }
}